app/views/drinks/new.html.erb

SELECT "categories".* FROM "categories"
---
      <%= f.label :category %>
      <%= f.select :category, Category.all.collect { |c| [ c.name ] }, include_blank: true %>