app/controllers/categories_controller.rb

  def index
    @categories = Category.all.page(params[:page])
---
SELECT  "categories".* FROM "categories" LIMIT 25 OFFSET 0
SELECT COUNT(count_column) FROM (SELECT  1 AS count_column FROM "categories" LIMIT 25 OFFSET 0) subquery_for_count

  def show
    @drinks = Drink.where("category_id = ?", params[:id]).page(params[:page])
---
SELECT  "drinks".* FROM "drinks" WHERE (category_id = 1)  ORDER BY "drinks"."id" ASC LIMIT 1
SELECT COUNT(count_column) FROM (SELECT  1 AS count_column FROM "drinks" WHERE (category_id = 'martini') LIMIT 25 OFFSET 0) subquery_for_count