app/controllers/drinks_controller.rb

INSERT INTO "drinks" ("title", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Testaroo"], ["description", "Test"], ["created_at", "2015-06-21 18:31:05.628270"], ["updated_at", "2015-06-21 18:31:05.628270"]]
---
  def create
    @drink = Drink.new(drink_params)
    if @drink.save

SELECT  "drinks".* FROM "drinks" LIMIT 25 OFFSET 0
SELECT COUNT(count_column) FROM (SELECT  1 AS count_column FROM "drinks" LIMIT 25 OFFSET 0) subquery_for_count
---
  def index
    @drinks = Drink.all.page(params[:page])

DELETE FROM "drinks" WHERE "drinks"."id" = $1  [["id", 9]]
---
  def destroy
    Drink.delete(params[:id])