app/controllers/featured_drinks_controller.rb

SELECT  "drinks".* FROM "drinks" WHERE (featured = 't') LIMIT 25 OFFSET 0
SELECT COUNT(count_column) FROM (SELECT  1 AS count_column FROM "drinks" WHERE (featured = 't') LIMIT 25 OFFSET 0) subquery_for_count
---
  def index
    @drinks = Drink.where("featured = ?", true).page(params[:page])